<a href="https://colab.research.google.com/github/zqiaohe/100daysofcode/blob/master/Titanic_1_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Домашнее задание 1.2

>1. Загрузите выборку из файла titanic.csv с помощью пакета Pandas.

In [0]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

In [0]:
df = pd.read_csv('titanic.csv')

In [97]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

>2) Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).

In [0]:
data = df[['Pclass', 'Sex', 'Age', 'Fare', 'Survived']]

>3) Обратите внимание, что признак Sex имеет строковые значения.

In [0]:
data = data.replace('female', 0)
data = data.replace('male', 1)

In [102]:
data.head(10)

    Pclass  Sex   Age     Fare  Survived
0        3    1  22.0   7.2500         0
1        1    0  38.0  71.2833         1
2        3    0  26.0   7.9250         1
3        1    0  35.0  53.1000         1
4        3    1  35.0   8.0500         0
6        1    1  54.0  51.8625         0
7        3    1   2.0  21.0750         0
8        3    0  27.0  11.1333         1
9        2    0  14.0  30.0708         1
10       3    0   4.0  16.7000         1

In [0]:
data = data[~np.isnan(data['Age'])]

In [0]:
dataY = data['Survived']

In [0]:
data = data[['Pclass', 'Sex', 'Age', 'Fare']]

In [105]:
dataY.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию (речь идет о параметрах конструктора DecisionTreeСlassifier).

In [0]:
clf = DecisionTreeClassifier(random_state=241)

In [108]:
clf.fit(data, dataY)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=241,
            splitter='best')

In [0]:
importances = clf.feature_importances_

In [110]:
importances

array([0.14000522, 0.30051221, 0.2560461 , 0.30343647])